emacs/readme.el
;; -*- coding: utf-8; lexical-binding: t -*-

(setq gc-cons-threshold 100000000)
(setq max-specpdl-size 5000)

(bind-key* "C-c ;" #'execute-extended-command)
(bind-key* "C-c 4" #'execute-extended-command) ;; for a purely left-handed combo
(bind-key* "C-c C-;" #'execute-extended-command-for-buffer)

;; exec-path-from shell was misbehaving, this hack seems to mollify it
(use-package exec-path-from-shell
  :hook (after-init . exec-path-from-shell-initialize)
  :config
  (setq exec-path-from-shell-debug t)
  (exec-path-from-shell-copy-env "HTTPS_PROXY")
  (exec-path-from-shell-copy-env "HTTP_PROXY")
  (exec-path-from-shell-copy-env "ALL_PROXY")
  (exec-path-from-shell-copy-env "LLVM_HOME")
  (exec-path-from-shell-copy-env "LDFLAGS")
  (exec-path-from-shell-copy-env "CPPFLAGS")
  (exec-path-from-shell-copy-env "CARGO_HOME")
  (exec-path-from-shell-copy-env "RUSTUP_HOME"))

(use-package use-package-ensure-system-package)

;; Title
