emacs/readme.org
** Fixing defaults

Fixing Emacs's defaults is a nontrivial problem. We'll start with UI concerns.

#+begin_src emacs-lisp
  ;; Title
  (setq frame-title-format '("Vinci & Kate's Gnu Emacs - %b")
        icon-title-format frame-title-format)

  ;; Set proxy configurations in emacs
  (setq url-proxy-services
        '(("no_proxy" . "^\\(localhost\\|127.0.0.1\\)")
          ("http" . "localhost:6152")
          ("https" . "localhost:6152")))

  (setq-default major-mode 'text-mode
                fill-column 80
                tab-width 4
                indent-tabs-mode nil     ; Permanently indent with spaces, never with TABs
                truncate-lines t
                display-line-numbers-width 3
                indicate-buffer-boundaries 'left
                display-fill-column-indicator-character ?\u254e)

  (setq visible-bell nil
        inhibit-compacting-font-caches t  ; Don’t compact font caches during GC
        delete-by-moving-to-trash t       ; Deleting files go to OS's trash folder
        make-backup-files nil             ; Forbide to make backup files
        auto-save-default nil             ; Disable auto save
        blink-cursor-mode nil             ; No eyes distraction
        column-number-mode t
        create-lockfiles nil
        uniquify-buffer-name-style 'post-forward-angle-brackets ; Show path if names are same
        adaptive-fill-regexp "[ t]+|[ t]*([0-9]+.|*+)[ t]*"
        adaptive-fill-first-line-regexp "^* *$"
        sentence-end "\\([。！？]\\|……\\|[.?!][]\"')}]*\\($\\|[ \t]\\)\\)[ \t\n]*"
        sentence-end-double-space nil     ; Double-spaces after periods is morally wrong.
        word-wrap-by-category t
        use-short-answers t
        mark-even-if-inactive nil         ; Fix undo in commands affecting the mark.
        ;; Suppress GUI features
        use-file-dialog nil
        use-dialog-box nil
        inhibit-startup-screen t
        inhibit-startup-echo-area-message user-login-name
        inhibit-default-init t
        ;; Let C-k delete the whole line.
        kill-whole-line t
        ;; search should be case-sensitive by default
        case-fold-search nil
        ;; I want to close these fast, so switch to it so I can just hit 'q'
        help-window-select t
        ;; highlight error messages more aggressively
        next-error-message-highlight t
        ;; don't let the minibuffer muck up my window tiling
        read-minibuffer-restore-windows t
        ;; don't let the minibuffer muck up my window tiling
        read-minibuffer-restore-windows t
        ;; scope save prompts to individual projects
        save-some-buffers-default-predicate 'save-some-buffers-root
        ;; don't keep duplicate entries in kill ring
        kill-do-not-save-duplicates t
        truncate-string-ellipsis "…"  ;; unicode ellipses are better
        custom-safe-themes t
        mouse-wheel-tilt-scroll t
        mouse-wheel-flip-direction t
        ;; eke out a little more scrolling performance
        fast-but-imprecise-scrolling t
        ;; prefer newer elisp files
        load-prefer-newer t
        ;; more info in completions
        completions-detailed t
        ;; 允许在活动的minibuffer中执行命令并打开新的minibuffer。这样可以实现命令的嵌套。
        enable-recursive-minibuffers t
        ;; Some pretty config from prucell
        initial-scratch-message (concat ";; Happy hacking, " user-login-name " - Emacs ♥ you!\n\n"))

  (global-auto-revert-mode t)  ;; Automatically show changes if the file has changed
  (delete-selection-mode t)    ;; You can select text and delete it by typing.
  (savehist-mode)
  (minibuffer-depth-indicate-mode) ;;开头显示当前嵌套层级的深度,用方括号括起,以示区分
  ;; UTF-8 should always, always be the default.
  (set-charset-priority 'unicode)
  (prefer-coding-system 'utf-8-unix)

  ;; Emacs has problems with very long lines.
  (global-so-long-mode)

  ;; URLs should be highlighted and linkified.
  (global-goto-address-mode)

  ;; Display wrape line
  (global-display-fill-column-indicator-mode 1)
  (global-visual-line-mode 1)

  ;; Show line numbers
  (global-display-line-numbers-mode 1)
  (setq display-line-numbers-type 'relative)

  ;; Eemacs true transparent
  (set-frame-parameter (selected-frame) 'alpha '(90 90))
  (add-to-list 'default-frame-alist '(alpha 90 90))

  ;; Emacs requires you to hit ESC three times to escape quit the minibuffer.
  (global-set-key [escape] 'keyboard-escape-quit)

  ;; Fonts
  (defun vk/setup-fonts ()
    (set-face-attribute 'default nil
                        :family "Iosevka Fixed"
                        :height 150)

    (set-fontset-font t 'symbol (font-spec :family "Nerd Font Symbol Mono") nil 'prepend)
    (set-fontset-font t 'emoji (font-spec :family "Apple Color Emoji") nil 'prepend)
    (set-fontset-font t 'han (font-spec :family "Source Han Sans CN"))

    (set-face-attribute 'font-lock-comment-face nil :slant 'italic)
    (set-face-attribute 'font-lock-keyword-face nil :slant 'italic))

  (vk/setup-fonts)
  (add-hook 'window-setup-hook #'vk/setup-fonts)
  (add-hook 'server-after-make-frame-hook #'vk/setup-fonts)
#+end_src

Change key for mac, many times s key is useful

#+begin_src emacs-lisp
  (when (eq system-type 'darwin)
    (setq mac-command-modifier 'meta
          mac-option-modifier 'none
          mac-right-command-modifier 'super))
#+end_src

Keep modeline clean.

#+begin_src emacs-lisp
  (use-package diminish
    :config (diminish 'visual-line-mode))

#+end_src

Keep ~/.emacs.d/ clean.

#+begin_src emacs-lisp
  (use-package no-littering
    ;; After no-littering
    ;; Set user custom
    :config
    (setq custom-file (no-littering-expand-etc-file-name "vk-custom.el")))

#+end_src

Emacs 27 comes with fast current-line highlight functionality, but it can produce some visual feedback in ~vterm~ buffers, so we only activate it in programming or text modes.

#+begin_src emacs-lisp
  (use-package hl-line)
  (add-hook 'prog-mode-hook #'hl-line-mode)
  (add-hook 'text-mode-hook #'hl-line-mode)
#+end_src

There are a great many keybindings that are actively hostile, in that they are bound to useless or obsolete functions that are really easy to trigger accidentally. (The lambda is because ~unbind-key~ is a macro.)

#+begin_src emacs-lisp
  (defun vk/unbind-bad-keybindings ()
    "Remove unhelpful keybindings."
    (-map (lambda (x) (unbind-key x))
          '("C-x C-r"         ;; find-file-read-only
            "C-x C-f"         ;; find-file
            "C-x C-d"         ;; list-directory
            "C-z"             ;; suspend-frame
            "C-x C-z"         ;; again
            "<mouse-2>"       ;; pasting with mouse-wheel click
            "<C-wheel-down>"  ;; text scale adjust
            "<C-wheel-up>"    ;; ditto
            "s-l"             ;; goto-line
            "s-w"             ;; delete-frame
            "s-n"             ;; make-frame
            "s-t"             ;; ns-popup-font-panel
            "s-p"             ;; ns-print-buffer
            "C-x C-q"         ;; read-only-mode
            "C-x C-c"         ;; quit emacs
            "C-h")))          ;; help
#+end_src

These libraries are helpful to have around when writing little bits of elisp, like the above. You can't possibly force me to remember the difference between the ~mapcar~, ~mapc~, ~mapcan~, ~mapconcat~, the ~cl-~ versions of some of the aforementioned, and ~seq-map~. I refuse. ~shut-up~ is good for noisy packages.

#+begin_src emacs-lisp
  (use-package s)
  (use-package dash :config (vk/unbind-bad-keybindings))
  (use-package shut-up)
#+end_src

In the name of avoiding RSI, which has become a feared nemesis, I bind ~C-h~ to backwards-delete-char, as per the macOS keybindings. But this means I have to rebind the keys that I actually use for help purposes.

#+begin_src emacs-lisp
  (bind-key* "C-h" #'backward-delete-char)
  (bind-key* "M-h" #'backward-delete-word)
  (bind-key* "C-c C-h k" #'describe-key)
  (bind-key* "C-c C-h f" #'describe-function)
  (bind-key* "C-c C-h m" #'describe-mode)
  (bind-key* "C-c C-h v" #'describe-variable)
  (bind-key* "C-c C-h l" #'view-lossage)
#+end_src

Emacs can jump between header files and implementation files, or implementations and tests, as needed.

#+begin_src emacs-lisp
  (bind-key "s-<up>" #'ff-find-related-file)
  (bind-key "C-c a f" #'ff-find-related-file)
#+end_src

Searching should be done with isearch, for UI purposes.

#+begin_src emacs-lisp
  (bind-key "C-s" #'isearch-forward-regexp)
  (bind-key "C-c s" #'isearch-forward-symbol)
#+end_src

The out-of-the-box treatment of whitespace is unfortunate, but fixable.

#+begin_src emacs-lisp
  (add-hook 'before-save-hook #'delete-trailing-whitespace)
  (setq require-final-newline t)
  (bind-key "C-c q" #'fill-paragraph)
  (bind-key "C-c Q" #'set-fill-column)

  (defun pt/indent-just-yanked ()
    "Re-indent whatever you just yanked appropriately."
    (interactive)
    (exchange-point-and-mark)
    (indent-region (region-beginning) (region-end))
    (deactivate-mark))

  (bind-key "C-c I" #'pt/indent-just-yanked)
#+end_src

Undo has always been problematic for me in Emacs. I used to use ~undo-tree-mode~ but it's been unmaintained for some time. I'm giving ~vundo~ a shot for the time being.

#+begin_src emacs-lisp
  (use-package vundo
    :diminish
    :bind* (("C-c _" . vundo))
    :custom (vundo-glyph-alist vundo-unicode-symbols))
#+end_src

I define a couple of my own configuration variables with ~defvar~, and no matter how many times I mark the variable as safe, it warns me every time I set it in the ~.dir-locals~ file. Disabling these warnings is probably (?) the right thing to do.

#+begin_src emacs-lisp
  (setq enable-local-variables :all)
#+end_src

By default, Emacs wraps long lines, inserting a little icon to indicate this. I find this a bit naff. What we can do to mimic more modern behavior is to allow line truncation by default, but also allow touchpad-style scrolling of the document.

#+begin_src emacs-lisp
  (setq mouse-wheel-tilt-scroll t
        mouse-wheel-flip-direction t)
  (setq-default truncate-lines t)
#+end_src

By default, Emacs ships with a nice completion system based on buffer contents, but inexplicably cripples its functionality by setting this completion system to ignore case in inserted results. Absolutely remarkable choice of defaults.

#+begin_src emacs-lisp
  (use-package dabbrev
    :bind* (("C-/" . #'dabbrev-completion))
    :custom
    (dabbrev-check-all-buffers t)
    (dabbrev-case-replace nil))
#+end_src

I'm trying to use some abbrevs to help with tedious patterns like checking ~if err == nil~ in Go.

#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'abbrev-mode)
  (setq abbrev-suggest t)
#+end_src

I never want to quit if readme.org is in a bad state. This warns me should I accidentally do so.

#+begin_src emacs-lisp
  (defun check-config ()
    "Warn if exiting Emacs with a readme.org that doesn't load."
    (or
     (ignore-errors (org-babel-load-file "~/.config/emacs/readme.org"))
     (y-or-n-p "Configuration file may be malformed: really exit?")))

  (push #'check-config kill-emacs-query-functions)
#+end_src

